This is full "working" example:

```
locals {
  _tables_all = {
    t1 = {
      tb_name = "TEST.PUBLIC.T1"
      type = "event"
      data_retention_time_in_days = 1
      active = true
      # comment = "test comment"
    }
  }
  event_tables=  {for t,tv in local._tables_all:
                                    tv.tb_name => {
                                      tb_name                     = tv.tb_name
                                      data_retention_time_in_days = try(tv.data_retention_time_in_days, null)
                                      active                      = try(tv.active, false)
                                      comment                     = try(tv.comment, null)
                                    }
                                    if try(tv.type, "") == "event"
                                  }
}

output "event_tables" {
  value = local.event_tables
}

resource "snowflake_execute" "event_table" {
  for_each =  local.event_tables

  execute = <<-EOT
    CREATE EVENT TABLE IF NOT EXISTS ${each.value.tb_name}
    ${try(format("DATA_RETENTION_TIME_IN_DAYS = %s", each.value.data_retention_time_in_days), "")}
    ${try(format("WITH COMMENT = '%s'", each.value.comment), "")}
  EOT
  revert = "DROP TABLE IF EXISTS ${each.value.tb_name}"
  query  = "SHOW EVENT TABLES LIKE '${each.value.tb_name}'"
}

```

Plan result for terraform v1.10.5:
```
  # snowflake_execute.event_table["TEST.PUBLIC.T1"] will be created
  + resource "snowflake_execute" "event_table" {
      + execute       = <<-EOT
            CREATE EVENT TABLE IF NOT EXISTS TEST.PUBLIC.T1
            DATA_RETENTION_TIME_IN_DAYS = 1
        EOT
      + id            = (known after apply)
      + query         = "SHOW EVENT TABLES LIKE 'TEST.PUBLIC.T1'"
      + query_results = (known after apply)
      + revert        = "DROP TABLE IF EXISTS TEST.PUBLIC.T1"
    }
```

Plan result for terraform v1.11.4:
```
  # snowflake_execute.event_table["TEST.PUBLIC.T1"] will be created
  + resource "snowflake_execute" "event_table" {
      + execute       = (known after apply)
      + id            = (known after apply)
      + query         = "SHOW EVENT TABLES LIKE 'TEST.PUBLIC.T1'"
      + query_results = (known after apply)
      + revert        = "DROP TABLE IF EXISTS TEST.PUBLIC.T1"
    }
```

Please notice that for v1.11.4 `execute`  will be "known after apply" and `apply` result is:
```
snowflake_execute.event_table["TEST.PUBLIC.T1"]: Creating...
╷
│ Error: Configuration contains unknown value
│
│ configuration for snowflake_execute.event_table["TEST.PUBLIC.T1"] still contains unknown values during apply (this is a bug in Terraform; please report   
│ it!)
│ The following paths in the resource configuration are unknown:
│ cty.Path{cty.GetAttrStep{Name:"execute"}}
```